Repository: EgonLaHire/active-directory-integration2
Catalog: languages/neosit-skeleton-plugin-*.po
Languages: de_de

source: You do not have sufficient permissions.
de_de: Sie besitzen nicht die benötigten Rechte um diesen Inhalt anzeigen zu lassen.

source: Domain Controllers (separate with semicolons, e.g. "dc1.company.local;dc2.company.local")
de_de: Domain Controllers (trennen sie bei der Verwendung mehrerer Controller jeden Controller mit einem Semikolon. Beispiel: "dc1.company.local;dc2.company.local"

source: The domain controller represents the Active Directory component used to change values in the user and computer database. You can find your currently set domain controller via "Start -> Run -> nslookup".
de_de: Unter dem Domain Controller versteht man die Componente des Active Directory Servers welche Änderungen an der Nutzer- und Computerdatenbank vornimmt. Sie können ihren momentan gesetzten Domain Controller finden indem sie folgende Schritte befolgen: Start -> "Ausführen -> nslookup"

source: Port on which the Active Directory listens (defaults to "389").
de_de: Port auf welchem Active Directory lauscht. (Standart: "389").

source: This option defines the Active Directory communication port and is default set to 389.
de_de: Diese Option bestimmt den Active Directory kommunikations Port und ist standartmäßig auf "389" gesetzt.

source: Use START_TLS
de_de: Benutze START_TLS

source: Secures the connection between the WordPress and the Active Directory servers using START_TLS
de_de: Sichert die Kommunikation zwischen dem Wordpress Server und dem Active Directory Server indem ADI das Verschlüsselungsprotokoll TLS verwendet wird.

source: Enabling this option activates the TLS (Transport Layer Security), which secures the data transport between your Active Directory Server and Wordpress by encrypting the data. If you want to use START_TLS, the "Port" option has to be set as default("389").
de_de: Durch das Aktivieren dieser Option, benutzt ADI zur Übertragung das Verschlüsslungsprotokol TLS. Dadurch wird der Datenverkehr zwischen Wordpress und Active Directory Server verschlüsselt.

source: LDAP Network Timeout
de_de: LDAP Netzwerk Timeout

source: Time in seconds after connection attempt to Active Directory times out and WordPress falls back to local authorization (defaults to "5").
de_de: Zeit in Sekunden nach einem Versuch eine Verbindung zum Active Directory Server herzustellen, bevor auf lokale Authentifizierung zurück gegriffen wird.

source: This option describes the time in seconds, which has to pass after a connection attempt to the Active Dirctory server before the the connection times out and falls back to the local wordpress authorization. The default value for this option is 5.
de_de: Diese Option beschreibt die Zeit in Sekunden, welche nach einem Verbindungsversuch zum Active Directory Server vergehen muss, damit die Authentifizierung fehlschlägt und der Benutzer sich über das lokale Wordpress Login Systeme versuchen kann zu authentifizieren. Standartmäßig beträgt die Zeit 5 Sekunden.

source: You can find your Active Directory Base DN, if you follow this step by step guide correctly.
de_de: Sie können ihren Active Directory Base DN finden, indem sie folgende Schritte befolgen.

source: 1. Access the your Active Directory Server via remote desktop.
de_de: 1. Verbinden sie sich zur ihrem Active Directory Server via remote desktop

source: 2. Start -> Administrative Tools -> Active Directory Users and Computers
de_de: 2. Start -> Administratorwerkzeuge -> Active Directory Benutzer und Computer

source: 3. Doubleclick your controller -> rightclick Users -> Properties
de_de: 3. Doppelklicken sie ihren Controller -> rechtsklicken sie Benutzer -> Eigenschaften

source: 4. Attribute -> Select distinguishedName in the list -> press View
de_de: 4. Eigenschaften -> wählen sie distinguishedName in der Liste aus -> drücken sie Anzeigen

source: 5. Copy your Base DN.
de_de: Kopieren sie ihren Base DN.

source: This suffix will be appended to all usernames in the Active Directory authentication process; e.g., "@company.local".)
de_de: Das Account Suffix wird allen Benutzernamen im Active Directory Authentifizierungsprozess hinzugefügt. Bespiel: "@company.local".

source: The Account Suffix is added to all usernames in the Active Directory authentication process.
de_de: Das Account Suffix wird allen Benutzernamen im Active Directory Authentigizierungsprozess hinzugefügt.

source: Example: username: companyEmployerMax -> Active Directory authentication -> companyEmployerMax@company.local
de_de: Beispiel: Benutzername: MitarbeiterMax -> Active Directory Authentifizierung -> MitarbeiterMax@company.local

source: Do not forget to set the @
de_de: Vergessen sie bitte nicht das @ zu setzen.

source: If you have multiple account suffixes like @company.local, @emea.company.local and @africa.company.local seperate them by a semicolon (;) and put the main (@company.local) at the last position.
de_de: Wenn sie mehrere Account Suffixe benutzen wie zum Beispiel: @company.local, @emea.company.local und @africa.company.local, trennen sie die einzelnen Suffixe voneinander indem sie ein Semikolon verwenden. Das Hauptsuffix muss hierbei an letzter Stelle stehen.

source: Example: @emea.company.local;@africa.company.local;@company.local
de_de: Beispiel: @emea.company.local;@africa.company.local;@company.local

source: Append suffix to new users
de_de: Füge Suffix neuen Benutzern hinzu

source: If checked, the account suffix (see above) will be appended to the usernames of new created users.
de_de: Durch das Aktivieren dieser Option wird das oben angegebene Suffix automatisch allen neu erstellten Benutzern hinzugefügt.

source: This option will automatically add the previously defined Account Suffix to all new created users.
de_de: Diese Option sorgt dafür, dass das zuvor definierte Suffix automatisch allen neu erstellten Benutzern hinzugefügt wird.

source: Auto Create User
de_de: Automatische Benutzer Erstellung

source: Automatically creates a new user if it´s not already existing in the Wordpress database.
de_de: Benutzer werden automatisch erstellt wenn sie noch nicht in der Wordpress Datenbank existieren.

source: Created users will obtain the role defined under "New User Default Role" on the "General Options" tab.
de_de: Erstellten Benutzern wird automatisch die Rolle zugewiesen welche unter "Neue Benutzer Standart Rolle" welche unter dem Reiter "Allgmeine Optionen" hinterlegt ist.

source: This option is separated from the Role Equivalent Groups option, below.
de_de: Diese Option hat keine Beziehungen zu den Benutzer Berechtigungsgruppen, welche sie weiter unten in diesem Reiter finden können.

source: Auto Update User
de_de: Automatische Benutzer Aktuallisierung

source: Updates users in the Wordpress database everytime they logon.
de_de: Aktuallisiert die zu einem Benutzer gehörenden Einträge in der Wordpress Datenbank bei jedem Login.

source: Enabling this option will result in ADI updating users in the Wordpress database everytime they logon.
de_de: Durch das Aktivieren dieser Option wird ADI jedes mal die Wordpress Datenbankeinträge mit den Active Directory Daten aktuallisieren, sobald sich dieser einloggt.

source: Works only if "Automatic User Creation" is turned on.
de_de: Funktioniert nur wenn "Automatische Benutzer Erstellung" aktiviert ist.

source: Auto Update User Description
de_de: Automatische Aktuallisierung der Benutzerbeschreibung

source: This option will only work if you already enabled Automatic User Creation and Automatic User Update. As the title says it will automatically update the description of new created users and users who login.
de_de: Diese Option wird nur funktionieren wenn sie bereits Automatische Benutzer Erstellung und Automatische Benutzer Aktuallisierung aktiviert haben. Wie der Titel schon sagt wird hierdurch die Beschreibung von neu erstellten Benutzern und Benutzern, welche sich erfolgreich einloggen aktuallisiert.

source: Works only if "Automatic User Creation" and "Automatic User Update" is turned on.
de_de: Diese Option wird nur funktionieren wenn Automatische Benutzer Erstellung und Automatische Benutzer Aktuallisierung aktiviert sind.

source: Default email domain
de_de: Standart E-Mail Domain

source: If the Active Directory attribute "mail" is blank, a user"s email will be set to username@ValueOfThisTextbox.
de_de: Wenn das Active Directory Attribut "mail" leer ist, wird die E-Mail eines Benutzers auf benutzername@WertdieserBox gesetzt.

source: If the Active Directory attribute "mail" is blank, a users email will be set to username@ValueOfThisTextbox.
de_de: Beispieltext

source: Email Address Conflict Handling
de_de: E-Mail Adressen Konfliktbehandlung

source: Choose how to handle email address conflicts.
de_de: Bitte wählen sie aus wie E-Mail Konflikte gelöst werden sollen.

source: Prevent (recommended)
de_de: Verhindern (empfohlen)

source: Allow (UNSAFE)
de_de: Erlauben (unsicher)

source: Create
de_de: Erstellen

source: On this option you can configurate the handling of email address conflicts.
de_de: Diese Option gibt an wie E-Mail Konflikte gelöst werden sollen.

source: Prevent: User is not created, if his email address is already in use by another user. (recommended)
de_de: Verhindern: Benutzer wird nicht erstellt, wenn die E-Mail Adresse bereits in Benutzung ist. (empfohlen)

source: Allow: Allow users to share one email address. (UNSAFE)
de_de: Erlauben: Erlaubt Benutzern sich eine E-Mail Adresse zu teilen. (UNSICHER)

source: Create: In case of conflict, the new user is created with a unique email address.
de_de: Erstellen: Im Fall eines Konflikts wird der neue Benutzer mit einer neuen einzigartigen E-Mail Adresse erstellt.

source: Prevent Email Change
de_de: Verhindere Änderung der E-Mail Adresse

source: Prevents users authenticated by Active Directory from changing their email address in WordPress.
de_de: Verhindert, dass Benutzer welche sich gegenüber des Active Directory authentifiziert haben ihr E-Mail Adresse in Wordpress ändern.

source: Activating this option will forbid users authenticated by Active Directory to change their email address in in Wordpress.
de_de: Durch das Aktivieren dieser Option wird ADI verhindern, dass Benutzer welche sich gegenüber des Active Directory authentifiziert haben ihre E-Mail Adresse in Wordpress ändern.

source: This option does not apply to the administrator.
de_de: Diese Option betrifft nicht die Administratoren.

source: Display name
de_de: Anzeigename

source: sAMAccountName (the username)
de_de: sAMAccountName (der Benutzername)

source: displayName
de_de: Anzeigename

source: description
de_de: Beschreibung

source: givenName (firstname)
de_de: givenName (Vorname)

source: SN (lastname)
de_de: SN (Nachname)

source: givenName SN (firstname lastname)
de_de: givenName SN (Vorname Nachname

source: CN (Common Name, the whole name)
de_de: CN (Common Name, der ganze Name)

source: mail
de_de: E-Mail

source: This option allows you to configurate how users should be displayed at new posts/comments.
de_de: Diese Option bestimmt das Authentifizierungsmerkmal über welches Kommentare/Beiträge Benutzern zugordnet werden können.

source: Show User Status
de_de: Zeige Benutzer Status

source: Show additional columns (ADI User, disabled) in the user list.
de_de: Zeige weitere Spalten (ADI Benutzer, deaktiviert) in der Benutzer Liste.

source: Allow local password changes
de_de: Erlaube lokale Password Änderung

source: Allow users to change their local (<strong>non Active Directory</strong>) WordPress password.
de_de: Diese Option erlaubt den Benutzern ihr lokales Wordpress Passwort zu ändern. (<strong>Dabei handelt es sich NICHT um das Active Directory Passwort</strong>)

source: Set local password on first successfull logon
de_de: Setze lokales Passwort beim ersten Einloggen

source: First time a user logs on successfully to your site his local Wordpress password is set to the one he used to authenticate against Active Directory.
de_de: Setzt das lokale Wordpress Passwort mit dem zur ersten erfolgreichen Authentifizierung gegen das Active Directory gleich.

source: The first time a user logs on, his local password will be equated with the password he used to authenticate against the Active Directory.
de_de: Wenn ein Benutzer sich das erste mal erfolgreich einloggt wird sein lokales Wordpress Passwort mit dem Passwort gleichgesetzt welches er bei der erfolgreichen Authentifizierung gegen das Active Directory verwendet hat.

source: If this option is deactivated a random password for this user will be set.
de_de: Wenn diese Option deaktiviert ist wird ein zufällig generiertes Passwort als lokales Passwort gesetzt.

source: Automatic Password Update
de_de: Automatische Passwort Aktuallisierung

source: Every time a user logs on successfully, his local WordPress password is set to the one used to authenticate against Active Directory.
de_de: Jedes mal wenn sich ein Benutzer erfolgreich Authentifiziert, wird sein lokales Wordpress Passwort mit dem zur erfolgreichen Authentifizierung verwendeten Passwort gleichgesetzt.

source: This option will update the local password everytime a user successfully logs on. This means if a user changed his Active Directory password and successfully authenticates against Active Directory while trying to login on Wordpress, his local wordpress password will be equated with the new Active Directory password.
de_de: Diese Option wird das lokale Wordpress Passwort jedes mal mit dem Passwort ersetzen, mit welchem sich der Benutzer erfolgreich gegen das Active Directory Authentifizieren konnte.

source: Note: Activating this option makes little sense when "Allow local password changes" is turned on.
de_de: Hinweis: Es macht wenig Sinn diese Option zu aktivieren, sollte sie zuvor bereits "Erlaube lokale Passwort Änderung" aktiviert haben.

source: Authorize by group membership
de_de: Authorisierung durch Gruppenmitgliedschaft

source: Activating this option will only grant members of the given group(s) below the possibility to authenticate against Active Directory.
de_de: Nur Mitglieder der durch sie bestimmten Gruppen habe die Möglichkeit sich gegen das Active Directory zu authentifizieren.

source: This option will only allow members of the given Active Directory groups to authenticate.
de_de: Diese Option erlaubt es Migliedern der weiter unten bestimmten Gruppen sich gegen das Active Directory zu authentifizieren.

source: Authorization groups
de_de: Authorisierungsgruppen

source: Seperate multiple groups by semicolon (e.g. "domain-users;WP-Users;test-users")
de_de: Sollten sie mehere Gruppen verwenden, trennen sie diese bitte durch ein Semikolon. Beispiel ("domain-users;WP-Users;test-users")

source: Please define your Authorization group(s) here. You can seperate multiple groups by using a semicolon.
de_de: Bitte definieren sie ihre Authorisierungsgruppen here. Sie können mehrere Gruppen angeben, indem sie diese mit einem Semikolon voneinander trennen.

source: Example: "domain-users;WP-Users;test-users"
de_de: Beispiel: "domain-users;WP-Users;test-users"

source: Works only if "Automatic User Creation" and "Automatic User Update" is turned on
de_de: Diese Option funktioniert nur wenn Automatische Benutzer Erstellung und Automatische Benutzer Aktuallisierung aktiviert sind.

source: Role Equivalent Groups
de_de: Rollen Berechtigungs Gruppen

source: List of Active Directory groups which correspond to WordPress user roles.
de_de: Liste von Active Directory Gruppen welche in direktem Bezug zu Wordpress Benutzer Rollen stehen.

source: Please enter the names of the groups which correspond to Wordpress user roles using the following schema. You have to seperate multiple groups by using semicolon again.
de_de: Bitte geben sie die Namen der Active Directory Gruppen an welche mit Wordpress Benutzer Rollen Gruppen in Verbindung stehen sollen. Bei Angabe mehrerer Gruppen, trennen sie bitte wieder die Gruppen durch ein Semikolon.

source: Example:
de_de: Beispiel_

source: ad-group=wp-role;
de_de: ad-gruppe=wp-rolle

source: You can find a whole table of Wordpress Roles and Capabilities at: " . "<a href=" . "http://codex.wordpress.org/Roles_and_Capabilities" . ">http://codex.wordpress.org/Roles_and_Capabilities</a>" . " (3.8 Capability vs. Role Table)
de_de: Sie finden eine komplette Tabelle aller Wordpress Benutzergruppen und Berechtigungen auf der folgenden Seite: " . "<a href=" . "http://codex.wordpress.org/Roles_and_Capabilities" . ">http://codex.wordpress.org/Roles_and_Capabilities</a>" . " (3.8 Capability vs. Role Table)

source: Group memberships cannot be checked across domains. So if you have two domains, instr and qc, and qc is the domain specified above, if instr is linked to qc, I can authenticate instr users, but not check instr group memberships.
de_de: Gruppenmitgliedschaften können nicht über verschiedene Domains überprüft werden. Wenn sie also zwei Domains haben, instr und qc und es sich bei qc um die zuvor spezifizierte handelt, währent instr mit qc verbunden ist, dann können instr Benutzer authentifiziert werden, aber es kann nicht abgefragt werden welche Gruppenmitgliedschaft sie besitzen.

source: Fallback to local password
de_de: Lokale Passwort Authentifizierung

source: Fallback to local(WordPress) password check if Active Directory authentication fails.
de_de: Bei fehlgeschlagener Active Directory Authentifizierung, kann der Benutzer sich gegenüber Wordpress authentifizieren.

source: If option is enabled, users who failed authenticating against Active Directory can authenticate again against the local wordpress password check.
de_de: Wenn die Active Directory Authentifizierung fehlschlägt wird dem Benutzer die Möglichkeit geboten sich über das Wordpress Authentifizierungssyste zu authentifizieren.

source: But this might be a security risk (for example, if the local password is outdated). <b>It"s recommended to turn this off.</b>
de_de: Hierbei können Sicherheitsrisken entstehen. (Zum Beispiel wenn das lokale Passwort alt ist.) <b>Es wird empfohlen diese Option zu deaktivieren.</b>

source: Enable lost password recovery
de_de: Aktiviere Passwort zurücksetzen

source: The user can reset his password in the login screen.
de_de: Der Benutzer hat die Möglichkeit sein Passwort auf der Authentifizierungsseite zurück zu setzen.

source: Turning this option on will allow users to reset their local password in the login screen.
de_de: Durch das aktivieren dieser Option geben sie Benutzern die Möglichkeit ihr lokales Passwort auf der Authentifizierungsseite von Wordpress zurück zu setzen.

source: Auto Login
de_de: Automatische Authentifizierung

source: Enables/Disables Auto Login
de_de: Aktiviert/Deaktiviert Automatische Authentifizierung

source: This option will grant users the possibility to Single Sign On Wordpress once they got authenticated against Active Directory. (Not Implemented Yet.)
de_de: Dieser Option ermöglicht dem Benutzer eine Automatische Authentifizierung wenn er sich vorher schon einmal gegen Active Directory bei einem anderen Dienst authentifiziert hat.

source: Previous ADI version
de_de: Vorherige ADI Version

source: Select previous ADI Options Version to be imported.
de_de: Wählen sie ihre zuvor verwendete Version von ADI aus.

source: Please select the version of the ADI plugin you previously used if your planning on importing your settings. Otherwise keep this selection box empty.
de_de: Bitte wählen sie ihre zuvor Verwendete Version von ADI aus wenn sie vorhaben ihre bereits in der alten Version konfigurierten Optionen zu importieren. Möchte sie ihre alten Konfigurationen nicht übernehmen, lassen sie dieses Feld einfach leer.

source: Auto import options
de_de: Automatischer Optionen Import

source: Automatically imports options from previous ADI versions when the plugin is activated. (Please select a version first.)
de_de: Diese Option Importiert automatisch ihre konfigurierten Optionen welche sie in einer früheren Version von ADI genutzt haben. (Bitte wählen sie zuerst eine Version aus.)

source: If activated ADI will automatically import options from the database of the above selected previously used ADI version. After turning this on you have to press the safe button and restart the plugin.
de_de: ADI wird nach der Aktivierung dieser Option beim neustarten des Plugins automatisch die von ihnen bereits in einer Vorgängerversion von ADI 2.0 konfigurierten Optionen importieren.

source: Maximum number of allowed login attempts
de_de: Maximale Anzahl an Authentifizierungsversuchen

source: Maximum number of failed login attempts before a user account is blocked. If empty or "0" Brute Force Protection is turned off.
de_de: Maximale Anzahl an fehlgeschlagenen Authentifizierungsversuchen bevor der Account blockiert wird. Wenn dieses Feld leer oder "0" ist wird der Brute Force Schutz ausgeschalten.

source: Please enter the ammount of trys a user has to login with his correct username and password combination before he gets blocked for the specific time you can set below this option.
de_de: Bitte geben sie die maximale Anzahl an Versuchen an, welche ein Benutzer hat um sich erfolreich mit seinem Benutzernamen und Passwort zu authentifizieren. Sollte diese Anzahl erreicht werden wird der Benutzer Account für die weiter unten angegebene Zeit gesperrt.

source: If you want to disable the bruteforce protection just set the Maximum number of allowed login attempts to 0.
de_de: Sperrzeit

source: Number of seconds an account is blocked after the maximum number of failed login attempts is reached.
de_de: Zeit in Sekunden wie lange ein Account gesperrt wird wenn die maximale Anzahl an fehlgeschlagenen Authentifizierungen erreicht ist.

source: On this option you can set the time a user is blocked after the above set ammount of failed login attempts is reached.
de_de: Diese Option Beschreibt die Zeit in Sekunden für wie lange ein Benutzer gesperrt wird wenn er die maximale Anzahl von Authentifizierungsversuchen durch fehlerhafte Eingabe seiner Benutzerdaten erreicht hat.

source: User Notification
de_de: Benutzer Benachrichtigung

source: Notify user by e-mail when his account is blocked.
de_de: Benachrichtige Benutzer sobald ihr Account gesperrt wird

source: Activating this option will allow ADI to notify a user via email about the circumstance that his account got blocked.
de_de: Das aktivieren dieser Option berechtigt ADI Benutzern eine E-Mail zu senden, sollte ihr Account gesperrt werden.

source: Admin Notification
de_de: Admin Benachrichtigung

source: Notify admin(s) by e-mail when an user account got blocked.
de_de: Informiert Admins per E-Mail wenn Benutzer Accounts gesperrt werden.

source: Enabling this option will notify the admin(s) about blocked user accounts aswell.
de_de: Durch das Aktivieren dieser Option werden auch Admins per E-Mail darüber benachrichtig wenn Benutzer Accounts gesperrt werden.

source: E-mail addresses for notifications
de_de: E-Mail Adressen zur Benachrichtigung

source: Seperate multiple addresses by semicolon (e.g. "admin@company.com;me@mydomain.org"). If left blank, notifications will be sent to the blog-administrator only.
de_de: Trenne bei Angabe mehrerer E-Mail Adressen jede Adresse durch ein Semikolon von der nächsten. Beispiel: "admin@company.com;me@mydomain.org", Sollte diese Angabe leer bleiben wird die Benachrichtigung automatisch an die E-Mail des Blog Administrators gesendet.
