Repository: EgonLaHire/active-directory-integration2
Catalog: languages/neosit-skeleton-plugin-*.po
Languages: de_de

source: This configurates the admin email, notifications are sent to. You can set multiple email addresses if you seperate them by using a semicolon. If this event gets triggered and no admin email is set, the email will be provided to the blog administrator email address. Example: "admin@company.com;me@mydomain.org"
de_de: Bei dieser Option können sie die Admin E-Mail Adresse(n) definieren, an welche Benachrichtigungen verschickt werdne. Sie können mehrere E-Mail Adressen angeben wenn sie diese durch das Verwenden von einem Semikolon voneinander trennen.

source: Additional User Attributes
de_de: Weitere Benutzer Attribute

source: AD User Attribute:
de_de: AD Benutzer Attribute

source: Data Type
de_de: Datentyp

source: Only a text
de_de: Nur ein Text

source: An array with texts
de_de: Ein Array mit Texten

source: Natural number
de_de: Natürliche Zahl

source: Time
de_de: Zeit

source: Timestamp
de_de: Zeitstempel

source: User Meta Key:
de_de: Benutzer Metaschlüssel

source: Enter additional Active Directory attributes (one per line), followed by their type and the associated meta key seperated by a colon (:).
de_de: Fügen sie zusätzliche Active Directory Attribute hinzu (eine pro Zeile), gefolgt von ihrem Typ und dem dazugehörigen Metaschlüssel, getrennt durch einen Doppelpunkt (:).

source: Additional Attributes that should appear on the user profile must also be placed in "Attributes to show".
de_de: Zusätzliche Eigenschaften welche auf dem Wordpress Benutzerprofile angezeigt werden sollen, sollten außerdem unter "Sichtbare Eigenschaften" eingetragen werden.

source: If no <i>&lt;meta key&gt;</i> is given the Active Directory attributes will be stored as <i>adi_&lt;attribute_name&gt;</i>.
de_de: Wenn kein <i>&lt;meta key&gt;</i> gegeben ist werden die Active Directory Eigenschaften als <i>adi_&lt;attribute_name&gt;</i> gespeichert.

source: Overwrite with empty values
de_de: Überschreibe mit leeren Werten

source: Overwrite local values even if the attribute values in Active Directory are empty.
de_de: Überschreibt lokale Werte auch dann wenn die Eigenschaften aus dem Active Directory leer sind.

source: Show Attributes
de_de: Sichtbare Attribute

source: Show user attributes from Active Directory in user profile.
de_de: Zeige Benutzer Eigenschaften aus dem Active Directory im Wordpress Benutzer Profile.

source: If you enable this option, Active Directory attributes will be shown automatically in the Wordpress user profile.
de_de: Durch die Aktivierung dieser Option werden Eigenschaften aus dem Active Directory automatisch im Wordpress Benutzer Profile angezeitgt.

source: Attributes to show
de_de: Zu zeigende Eigenschaften

source: Description:
de_de: Beschreibung:

source: Synchronize with Active Directory:
de_de: Synchronisiere mit dem Active Directory

source: Enter the Active Directory attributes (one per line) followed by a description seperated by a colon (:) to be shown at the end of the user profile page.
de_de: Deiniere eine Active Directory Eigenschaft (eine per Zeile) gefolgt von einer Beschreibung. Trenne beides durch die Verwendung eines Doppelpunktes. Beides wird am Ende des Benutzerprofiles angezeigt.

source: If no description is given the descriptions for standard attributes (see below) is used. If there is no description for the attribute then the attribute name itself will be displayed.
de_de: Wenn keine BEschreibung angegeben wird, wird die weiter unten angegebene Beschreibung für Standarteigenschaften verwentdet. Wenn keine Beschreibung für diese Eigenschaft hinterlegt ist, wird der Eigenschaftsname angezeigt.

source: The attributes to be shown must appear on the list of Additional User Attributes.
de_de: Die zu zeigende Eigenschaft muss in der Liste von Weiteren Benutzer Eigenschaften ausgeführt sein.

source: If want to make some attributes editable and written back to Active Directory on profile update add a trailing ":*" (Sync Back must be turned on, see below).
de_de: Wenn sie möchten das manche Eigenschaften bearbeitbar sind und zuück in das Active Directory übertragen werden, fügen sie ein ":*" hinzu. (Syncronisiere zurück zu Active Directory muss dafür aktiviert sein.)

source: If you enter something that is not in the list of Additional User Attributes it will be treated as normal text. Use this to structure the output.
de_de: Wenn sie etwas eingeben, was nicht in der Lister Weitere Benutzer Eigenschaften steht, wird es als normaler text behandelt.

source: Sync Back to Active Directory
de_de: Synchronisiere zurück zu Active Directory

source: Sync changed values of attributes marked with an asterisk (*) back to Active Directory on update of user profile.
de_de: Syncronisiert veränderte Eigenschaften, makiert durch ein Asterisk (*), zurück in das Active Directory beim Aktuallisieren des Wordpress Benutzer Profiles.

source: By activating this option ADI will automatically syncronize edited values of attributes back to the Active Directory.
de_de: Durch Aktivierung dieser Option wird ADI automatisch veränderte Eigenschaften aus dem Wordpress Benutzer Profile zum Active Directory übertragen.

source: For this to happen you have to mark the attributes with an asterisk (*).
de_de: Dazu müssen diese durch ein Asterisk (*) makiert wurden sein.

source: The Sync Back to Active Directory gets triggered whenever a user profile gets updated.
de_de: Die Syncronisierung zurück zum Active Directory wird automatisch aufgerufen wenn das Wordpress Benutzer Profil aktuallisiert wird.

source: Use Global Sync User
de_de: Benutze globalen Syncronisationsbenutzer

source: Use a Global Sync User for all writes to Active Directory. Leave this unchecked to ask for the users password on every sync back/profile update.
de_de: Benutzen sie einen globalen Syncronisationsbenutzer um Eigenschaften und andere Daten in ihr Active Directory zu schreiben. Wenn diese Option nicht aktiviert wird werden Benutzer bei jeder Aktuallisierung ihres Wordpress Profiles nach ihrem Passwort gefragt.

source: By NOT checking this option users will always get requested to enter their password on every sync back/profile update.
de_de: Durch nicht Aktivierung dieser Option werden Benutzer jedes mal wenn sie ihr Wordpress Profil aktuallisieren nach ihrem Passwort gefragt.

source: NOTICE: The password of the Global Sync User is stored encrypted, but USE AT YOUR OWN RISK. To avoid this you have to grant your users the permission to change their own AD attributes. See FAQ for details.
de_de: HINWEIS: Das Passwort des globalen Syncronisationsbenutzers wird verschlüsselt gespeichert. Benutzen sie es auf eigene Gefahr. Um diese Risiko zu verhindern, erlauben sie ihren Benutzern ihr Active Directory Attribute selbst zu ändern. Für weitere Information werden sie einen Blick in die FAQ.

source: Global Sync Username
de_de: Globaler Syncronisationsbenutzername

source: Username of an Active Directory account with write permissions for the users in the Active Directory (e.g. administrator@company.local).
de_de: Benutzername eines Active Directory Accounts mit Schreibrechten für die Benutzer in Acitvie Directory. Beispiel: adminstrator@company.local

source: If you define a Global Sync User with Active Directory users writing permission, changes will automatically be written in the Active Directory database through this user.
de_de: Durch das bestimmen eines Active Directory Benutzers mit Schreibrechten für die Benutzer, werden Änderungen an Wordpress Benutzer Profilen automatisch in die Active Directory Datenbank durch diesen Benutzer geschrieben.

source: Global Sync User Password
de_de: Globaler Syncronisationsbenutzer Passwort

source: Password for Global Sync User. Leave empty if password should not be changed.
de_de: Passwort für den globalen Syncronisationsbenutzer. Lassen sie dieses Feld leer wenn sie den Benutzernamen nicht ändern möchten.

source: This option defines a NEW password for the Global Sync User. Leave this field blank if you do not want to change the password.
de_de: Diese Option bestimmt ein neues Passwort für den globalen Syncronisationsbenutzer. Lassen sie dieses Feld leer wenn sie das Passwort nicht ändern möchten.

source: Sync Back Auth Code
de_de: Syncronisation zurück zum Active Directory Authentifizierungs Code

source: This code is needed for sync back. You can use numbers, lowercase and uppercase letters. Do not use special characters because they can cause problems (with curl etc.)
de_de: Dieser Code wird benötigt um für die Syncronisation von Daten zurück zum Active Directory. Benutzen sie keine Sonderzeichen da diese Probleme verursachen können (durch curl z.b.)

source: The authentication code is used to authenticate the global sync user against the Active Directory. You can use numbers, lowercase and uppercase letters. Do not use special characters because they can cause problems (with curl etc.)
de_de: Dieser Code wird benötigt um den Benutzer gegen das Active Directory zu authentifizieren.

source: Enable Bulk Import and Update
de_de: Aktiviere Massen Import und Update

source: Enabling this option will allow ADI to Import & Update users from the Active Directory to the Wordpress Database.
de_de: Durch Aktivierung dieser Option ermöglichen sie ADI eine Masse an Benutzern aus ihrem Active Directory in die Wordpress Datenbank zu importieren bzw diese zu aktuallisieren.

source: Hint: You could use a cron job, which is nothing more than a timetable executing the bulk import/update at from you defined times, to keep your wordpress database always up to date with your Active Directory user information.
de_de: Hinweis: Sie könnten zum Beispiel einen cron job benutzen. Dabei handelt es sich um eine zeitliche Ausführung eines Massen Imports bzw einer Massen Aktuallisierung von Benutzern zu von ihren bestimmten Zeiten. Dazu halten sie ihe Wordpress Datenbank mit den Daten aus dem Active Directory immer auf dem neuesten Stand.

source: Bulk User Auth Code
de_de: Massen Import Benutzer Authentifizierungs Code

source: This code is needed for bulk import. You can use numbers, lowercase and uppercase letters. Do not use special characters because they can cause problems (with curl etc.)
de_de: Dieser Code wird benötigt um den oben beschriebenen Massen Import bzw das Massen Update von benutzern auszuführen. Bitte benutzen sie keine Sonderzeichen da diese zu Problemen führen können.

source: Import members of security groups
de_de: Importiere Mitglieder einer Sicherheitsgruppe

source: The members of the security groups entered here, will be imported or updated automatically if the Bulk Import URL is opened
de_de: Die Mitglieder der Sicherheitsgruppe, welche sie weier unten definieren, werden automatisch importiert bzw aktuallisiert, wenn sich die Massen Import URL das nächste mal öffnet.

source: Here you can enter security groups for their members to be imported/updated automatically every time the Bulk Import URL is opened.
de_de: Beispieltext

source: Separate multiple groups by semicolon (e.g. "company user;WP-Users;test-users").
de_de: Trennen sie mehrere Gruppen wieder durch ein Semikolon.

source: If you want to include the users of the built in user group "domain users" you have to enter "domain users;id:513" (see FAQ for details).
de_de: Wenn sie Mitglieder der eingebauten Benutzer Gruppe "domain users" importieren möchten, müssen sie sie über folgendes Schema importieren. Beispiel: "domain users;id:513" Werfen sie einen Blick in die FAQ für weitere Informatione.

source: Bulk Import User
de_de: Massen Import Benutzernamet

source: Username of an Active Directory account with read permissions for the users in the Active Directory (e.g. "ldapuser@company.local").
de_de: Benutzername eines Active Directory Benutzer mit Leserechten für die Benutzer im Active Directory. Beispiel: "ldapuser@company.local"

source: In order for importing multiple users at once you have to define a user with Active Directory users read permission.
de_de: Um mehrere Benutzer aus dem Active Directory gleichzeitig in die Wordpress Datenbank zu Importieren muss ein Active Directory Benutzer mit Leserechten für die Active Directory Benutzer angegeben werden.

source: Bulk Import User Password
de_de: Massen Import Benutzerpasswort

source: Password for Bulk Import User.
de_de: Passswort für den Massen Import Benutzer

source: As you already defined the Bulk Import Username before you now have to define the password for this user aswell.
de_de: Genauso wie sie bereits den Benutzernamen für den Massen Import Benutzer angegeben haben, müssen sie nun das Passwort für ihn angeben.

source: Auto Disable Users
de_de: Automatische Benutzer deaktivierung

source: Disable users previously authenticated by ADI if they are not imported anymore or if they are disabled in Active Directory.
de_de: Deaktiviert automatisch Benutzer welche zuvor gegen das Active Directory authentifiziert wurden, nun aber nicht mehr importiert werden bzw im Active Directory deaktiviert sind.

source: Disabled users can only be reenabled manually by administrators on users profile page or by Bulk Import.
de_de: Deaktivierte Benutzer können nur durch einen Administrator über ihr Profile bzw. über den Massen Import wieder aktiviert werden.

source: Important option reminder
de_de: Wichtige Erinnerungen

source: Enable/Disable the important options reminder dialog.
de_de: Aktiviert/Deaktiviert das Popupfenster, welches einen über wichtige Informationen informiert.

source: By disabling this option the Dialog Messagebox reminding you about not configurated important options will not appear anymore.t
de_de: Durch deaktivierung dieser Option wird das Popupfenster welches sie über wichtige nicht konfigurierte Optionen informiert, nicht mehr erscheinen.

source: Server
de_de: Beispieltext

source: Active Directory Server
de_de: Beispieltext

source: User
de_de: Beispieltext

source: User-Settings
de_de: Beispieltext

source: Passwords
de_de: Beispieltext

source: Permissions
de_de: Beispieltext

source: Security
de_de: Beispieltext

source: Brute-Force-Protection
de_de: Beispieltext

source: For security reasons you can use the following options to prevent brute force attacks on your user accounts.
de_de: Beispieltext

source: User Meta
de_de: Beispieltext

source: User attributes from the Active Directory are stored as User Meta Data. These attributes can then be used in your themes and they can be shown on the profile page of your users.
de_de: Beispieltext

source: The attributes are only stored in the WordPress database if you activate "Automatic User Creation" and are only updated if you activate "Automatic User Update" on tab "User".
de_de: Beispieltext

source: Sync Back
de_de: Beispieltext

source: Bulk Import
de_de: Beispieltext

source: User Bulk Import & Update
de_de: Beispieltext
